In [87]:
#Instala a biblioteca pandas
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\dsadm\appdata\roaming\python\python313\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [88]:
#Importa a biblioteca pandas
import pandas as pd

In [10]:
#Criando um dicionário
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}
Label = ['1ª Linha', '2ª Linha', '3ª Linha']
Dataframe_01= pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [11]:
#Exibindo as colunas A e B
Dataframe_01[['A', 'B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [24]:
#Criando uma coluna nova no DataFrame
Dataframe_01['Nova Coluna'] = Dataframe_01['A'] * Dataframe_01['B']

In [25]:
Dataframe_01 #Exibe o DataFrame

          A  B   C  Nova Coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [29]:
# Exibindo os valores na saída da célula do notebook
a = 6
print(a) 
Dataframe_01

6

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [27]:
#Excluindo uma coluna 
#Drop exclui uma linha ou coluna do Dataframe
Dataframe_01.drop('Nova Coluna', axis = 1)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [28]:
#Excluindo uma coluna definitivamente do DataFrame
Dataframe_01.drop('Nova Coluna',axis = 1, inplace=True)

In [36]:
#Localizando uma linha do DataFRAME utlizando o comando Loc
Dataframe_01.loc['1ª Linha']

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [37]:
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [39]:
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [42]:
#Localizando diversas linhas e colunas
Dataframe_01.loc[['1ª Linha', '2ª Linha'], ['A', 'C']] #Nome da Linha e o Nome da Coluna

          A   C
1ª Linha  1   0
2ª Linha  2  10

In [ ]:
#Localizando a linha e a coluna pelo índice
Dataframe_01.iloc[2:3,1:] #Linha, coluna

          B   C
3ª Linha -1  20

In [56]:
Dataframe_01.iloc[0:1,0:] #Linha, coluna

          A  B  C
1ª Linha  1 -3  0

In [61]:
#Verifica a condição no DataFrame
print(Dataframe_01)
Dataframe_01 > 0

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [64]:
#Criando filtro no DataFrame
Filtro = Dataframe_01['C'] > 0 #Armazena em filtro a resposta da verificação
Dataframe_02 = Dataframe_01[Filtro] #Cria um novo DataFrame
Dataframe_02['B']

2ª Linha   -2
3ª Linha   -1
Name: B, dtype: int64

In [65]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [ ]:
#Cria um filtro utilizando  a condição  & e
Dataframe_01[(Dataframe_01['A'] > 1) & (Dataframe_01['C'] > 0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
#Cria um filtro utilizando  a condição | ou
Dataframe_01[(Dataframe_01['B'] > 5) | (Dataframe_01['C'] > 2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [69]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [71]:
#Resetando o índex do DataFrame
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [73]:
Dataframe_01.reset_index(inplace=True)

In [74]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [75]:
Dataframe_01.drop('index', axis=1, inplace=True) #Exclui a coluna index

In [77]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [90]:
#Criando vários dicionarios
Dicionario_01 = {
    'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': ['AA', 'BB', 'CC']
}

Dicionario_02 = {
    'A': [6,7,8],
    'B': [-39,-28,-17],
    'C': [1000, 10, 60],
    'Chave': ['AA', 'BB', 'CC']
}


Dicionario_03 = {
    'A': [11, 12, 13],
    'B': [-39, -22, -11],
    'C': [30, 10, 20],
    'Chave': ['AA', 'BB', 'CC']
}

#Criando as listas para serem labels
Label_01 = ['1ª Linha', '2ª Linha', '3ª Linha']
Label_02 = ['4ª Linha', '5ª Linha', '6ª Linha']
Label_03 = ['7ª Linha', '8ª Linha', '9ª Linha']

#Criando os dataframes
Dataframe_01n = pd.DataFrame(Dicionario_01, index=Label_01)
Dataframe_02n = pd.DataFrame(Dicionario_02,index= Label_02)
Dataframe_03 = pd.DataFrame(Dicionario_03, index= Label_03)

In [82]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [91]:
Dataframe_01n

          A   B   C
1ª Linha  1 -32  AA
2ª Linha  2 -21  BB
3ª Linha  3 -15  CC

In [92]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [93]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [94]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [95]:
#Empilhando os DataFrames 1,2,3
pd.concat([Dataframe_01n, Dataframe_02n, Dataframe_03])

           A   B     C Chave
1ª Linha   1 -32    AA   NaN
2ª Linha   2 -21    BB   NaN
3ª Linha   3 -15    CC   NaN
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC